;==========================================================
; FILE: ElementalHeavyThrowers.uc
;
; 文件创建者: RustyDios 2020年10月30日 12:00
; 最后更新时间 2020年11月17日 20:00
;
;==========================================================

[Heavythrower_Fire X2WeaponTemplate]
FriendlyName="火焰喷射器"
FriendlyNamePlural="火焰喷射器"
BriefSummary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形火焰。它拥有有限的弹药量。"
TacticalText=" <Bullet/>这款腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Fire_Mk2 X2WeaponTemplate]
FriendlyName="地狱火喷射器"
FriendlyNamePlural="地狱火喷射器"
BriefSummary="这款升级版的腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形火焰。它拥有有限的弹药量。"
TacticalText=" <Bullet/>这款升级版的腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。\n<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Fire_Soldier X2AbilityTemplate]
LocFriendlyName="火焰喷射器"
LocHelpText="向锥形区域喷射火焰。有一定几率造成燃烧效果。"

[Heavythrower_Fire_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="地狱火喷射器"
LocHelpText="向锥形区域喷射火焰。有一定几率造成燃烧效果。"

[Heavythrower_Fire_Spark X2AbilityTemplate]
LocFriendlyName="火焰喷射器 (SPARK)"
LocHelpText="向锥形区域喷射火焰。有一定几率造成燃烧效果。"

[Heavythrower_Fire_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="地狱火喷射器 (SPARK)"
LocHelpText="向锥形区域喷射火焰。有一定几率造成燃烧效果。"

;==========================================================
[Heavythrower_Cryo X2WeaponTemplate]
FriendlyName="冷冻喷射器"
FriendlyNamePlural="冷冻喷射器"
BriefSummary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形冷冻剂。它拥有有限的弹药量。"
TacticalText="<Bullet/> 这款腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。\n<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Cryo_Mk2 X2WeaponTemplate]
FriendlyName="九头蛇喷射器"
FriendlyNamePlural="九头蛇喷射器"
BriefSummary="这款升级版的腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形冷冻剂。它拥有有限的弹药量。"
TacticalText="<Bullet/> 这款升级版的腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。\n<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Cryo_Soldier X2AbilityTemplate]
LocFriendlyName="冷冻喷射器"
LocHelpText="向锥形区域喷射冷冻剂。有一定几率瞬间冻结目标。"

[Heavythrower_Cryo_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="九头蛇喷射器"
LocHelpText="向锥形区域喷射冷冻剂。有一定几率瞬间冻结目标。"

[Heavythrower_Cryo_Spark X2AbilityTemplate]
LocFriendlyName="冷冻喷射器 (SPARK)"
LocHelpText="向锥形区域喷射冷冻剂。有一定几率瞬间冻结目标。"

[Heavythrower_Cryo_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="九头蛇喷射器 (SPARK)"
LocHelpText="向锥形区域喷射冷冻剂。有一定几率瞬间冻结目标。"

;==========================================================
[Heavythrower_Poison X2WeaponTemplate]
FriendlyName="毒气喷射器"
FriendlyNamePlural="毒气喷射器"
BriefSummary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形毒气。它拥有有限的弹药量。"
TacticalText=" <Bullet/>这款腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。\n<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Poison_Mk2 X2WeaponTemplate]
FriendlyName="雾霭喷射器"
FriendlyNamePlural="雾霭喷射器"
BriefSummary="这款升级版的腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形毒气。它拥有有限的弹药量。"
TacticalText=" <Bullet/>这款升级版的腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。\n<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Poison_Soldier X2AbilityTemplate]
LocFriendlyName="毒气喷射器"
LocHelpText="向锥形区域喷射毒气。有一定几率使目标中毒。"

[Heavythrower_Poison_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="雾霭喷射器"
LocHelpText="向锥形区域喷射毒气。有一定几率使目标中毒。"

[Heavythrower_Poison_Spark X2AbilityTemplate]
LocFriendlyName="毒气喷射器 (SPARK)"
LocHelpText="向锥形区域喷射毒气。有一定几率使目标中毒。"

[Heavythrower_Poison_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="雾霭喷射器 (SPARK)"
LocHelpText="向锥形区域喷射毒气。有一定几率使目标中毒。"

;==========================================================
[Heavythrower_Acid X2WeaponTemplate]
FriendlyName="酸液喷射器"
FriendlyNamePlural="酸液喷射器"
BriefSummary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形酸液。它拥有有限的弹药量。"
TacticalText="<Bullet/> 这款腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。\n<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Acid_Mk2 X2WeaponTemplate]
FriendlyName="螺旋喷射器"
FriendlyNamePlural="螺旋喷射器"
BriefSummary="这款升级版的腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形酸液。它拥有有限的弹药量。"
TacticalText=" <Bullet/>这款升级版的腕装化学喷射器是一种范围攻击武器，能对战场大部分区域造成破坏。\n<Bullet/> 适用于近距离对抗多个敌人。机器人敌人可能对其效果具有抗性或免疫。\n<Bullet/> 能攻击区域内的所有目标，但可能被掩体阻挡。\n<Bullet/> 使用所有剩余行动点数，但受‘齐射’、‘燃烧冲刺’和‘造雨者’技能影响。"

[Heavythrower_Acid_Soldier X2AbilityTemplate]
LocFriendlyName="酸液喷射器"
LocHelpText="向锥形区域喷射酸液。能融化护甲并造成腐蚀性灼伤。"

[Heavythrower_Acid_Mk2_Soldier X2AbilityTemplate]
LocFriendlyName="螺旋喷射器"
LocHelpText="向锥形区域喷射酸液。能融化护甲并造成腐蚀性灼伤。"

[Heavythrower_Acid_Spark X2AbilityTemplate]
LocFriendlyName="酸液喷射器 (SPARK)"
LocHelpText="向锥形区域喷射酸液。能融化护甲并造成腐蚀性灼伤。"

[Heavythrower_Acid_Mk2_Spark X2AbilityTemplate]
LocFriendlyName="螺旋喷射器 (SPARK)"
LocHelpText="向锥形区域喷射酸液。能融化护甲并造成腐蚀性灼伤。"

;==========================================================
;游戏中不应看到这些内容，隐藏被动技能
; ... 但以防万一，复制了造雨者技能
; ... 可能有人需要悬浮提示？
[RustyRainmakerExtension X2AbilityTemplate]
LocFriendlyName="造雨者扩展"
LocLongDescription="装备的重型武器增加+<Ability:Rainmaker_BonusDamage/>点伤害，并扩大攻击范围。此扩展涵盖腕装化学喷射器。"
LocHelpText="装备的重型武器造成更多伤害，并影响更大区域。"
LocPromotionPopupText="<Bullet/> 造雨者技能为所有重型武器增加+<Ability:Rainmaker_BonusDamage/>点伤害。<br/><Bullet/>圆形攻击范围的重型武器半径增加+<Ability:Rainmaker_BonusRadius/>.<br/><Bullet/>锥形攻击范围的重型武器直径增加+<Ability:Rainmaker_BonusDiameter/>，长度增加+<Ability:Rainmaker_BonusLength/>.<br/>"
LocFlyover="造雨者扩展"

; ======================================================================
; ================ PROVING GROUND OVERHAUL V2 本地化 ===================
; ======================================================================

[Heavythrower_FireUnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：火焰"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形火焰。它拥有有限的弹药量。"

[Heavythrower_AcidUnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：酸液"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形酸液。它拥有有限的弹药量。"

[Heavythrower_CryoUnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：冷冻"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形冷冻剂。它拥有有限的弹药量。"

[Heavythrower_PoisonUnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：毒气"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形毒气。它拥有有限的弹药量。"

[Heavythrower_Fire_Lv2UnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：地狱火喷射器"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形火焰。它拥有有限的弹药量。"

[Heavythrower_Acid_Lv2UnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：螺旋喷射器"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形酸液。它拥有有限的弹药量。"

[Heavythrower_Cryo_Lv2UnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：九头蛇喷射器"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形冷冻剂。它拥有有限的弹药量。"

[Heavythrower_Poison_Lv2UnlockTech X2TechTemplate]
DisplayName="重型实验臂装喷射器：雾霭喷射器"
Summary="这款腕装化学喷射器依靠超高压化学弹药筒和宽幅聚焦喷嘴，向多个敌人释放致命的化学锥形毒气。它拥有有限的弹药量。"